frontend/test/resources/subscription.json

{
    "id": "sub_4Bt3MJQXzF3RG9",
    "plan": {
        "interval": "month",
        "name": "Patron plan",
        "created": 1401377308,
        "amount": 6000,
        "currency": "gbp",
        "id": "Patron",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": null,
        "metadata": {},
        "statement_description": null
    },
    "object": "subscription",
    "start": 1402329978,
    "status": "active",
    "customer": "cus_4Bt317qP0aKefO",
    "cancel_at_period_end": false,
    "current_period_start": 1402329978,
    "current_period_end": 1404921978,
    "ended_at": null,
    "trial_start": null,
    "trial_end": null,
    "canceled_at": null,
    "quantity": 1,
    "application_fee_percent": null,
    "discount": null,
    "metadata": {}
}
